loadtest.yml
config:
########## Target can be updated with the approrpiate production IP address, but would ideally contain a static DNS ###########
########## Process would also ideally be ran within some automated environment, as part of our CI/CD environments #############
  target: "http://0.0.0.0:3000" 
  phases:
    - duration: 3000
      arrivalRate: 100
      rampTo: 500
  defaults:
    headers:
      content-type: "application/json"

scenarios:
  - flow:
      - get:
          url: "/"